# BuiltInFailures.AnalyticalModelFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures Class
BuiltInFailures Class Members See Also
---
Failures about AnalyticalModel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class AnalyticalModelFailures
```

Visual Basic
---
```text
Public NotInheritable Class AnalyticalModelFailures
```

Visual C++
---
```text
public ref class AnalyticalModelFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..AnalyticalModelFailures
# See Also
BuiltInFailures..::..AnalyticalModelFailures Members
Autodesk.Revit.DB Namespace